v2206/solver_ADMFoam/multi_gasGenComparison/ADM_chem/system/setFieldsDict.box
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.liquid    1.0
    volScalarFieldValue alpha.gas       0.0 
);

regions
(
    boxToCell
    {
        box (0 -0.01 0) (1 0.00 1);
        fieldValues
        (
            volScalarFieldValue alpha.liquid     0.0
            volScalarFieldValue alpha.gas        1.0  
        );
    }
);


// ************************************************************************* //
